# 6. Data Selection(Basic)

In [12]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = 'number')
df

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

## Column Selection (label)

In [13]:
df[['name', 'school']]

         name  school
number
1        Park  GATech
2         Lee  GATech
3         Kim  GATech
4       Rishi  GATech
5        Chen  GATech

## Column Selection (index)

In [14]:
df.columns

Index(['name', 'school', 'language', 'gpa'], dtype='object')

In [16]:
df.columns[1]

'school'

In [15]:
df[df.columns[-1]]

number
1    3.4
2    3.2
3    3.8
4    4.0
5    3.5
Name: gpa, dtype: float64

## Slicing

In [17]:
df

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

In [18]:
df['name'][0:3] # 0 to 2 data of name

number
1    Park
2     Lee
3     Kim
Name: name, dtype: object

In [19]:
df[0:2]

        name  school language  gpa
number
1       Park  GATech   Python  3.4
2        Lee  GATech     Java  3.2